Autodesk.Revit.DB.FormatOptions.CanUsePlusPrefix(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a plus prefix can be displayed for a given unit.
unitTypeId:
Identifier of the unit.
Returns:
True if a plus prefix can be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressSpaces(Autodesk.Revit.DB.ForgeTypeId)
Checks whether spaces can be suppressed for a given unit.
unitTypeId:
Identifier of the unit.
Returns:
True if spaces can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressLeadingZeros(Autodesk.Revit.DB.ForgeTypeId)
Checks whether leading zeros can be suppressed for a given unit.
unitTypeId:
Identifier of the unit.
Returns:
True if leading zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressTrailingZeros(Autodesk.Revit.DB.ForgeTypeId)
Checks whether trailing zeros can be suppressed for a given unit.
unitTypeId:
Identifier of the unit.
Returns:
True if trailing zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidAccuracy(Autodesk.Revit.DB.ForgeTypeId,System.Double)
Checks whether an accuracy is valid for a given unit.
Remarks:
See the Accuracy property for details on
valid accuracy values.
unitTypeId:
Identifier of the unit.
accuracy:
The accuracy to check.
Returns:
True if the accuracy is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetValidSymbols
Gets the identifiers of all valid symbols for the unit in this FormatOptions.
Returns:
Identifiers of the valid symbols.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetValidSymbols(Autodesk.Revit.DB.ForgeTypeId)
Gets the identifiers of all valid symbols for a given unit.
unitTypeId:
Identifier of the unit.
Returns:
Identifiers of the valid symbols.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidSymbol(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a symbol is valid for the unit in this FormatOptions.
symbolTypeId:
Identifier of the symbol to check.
Returns:
True if the symbol is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidSymbol(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Checks whether a symbol is valid for a given unit.
unitTypeId:
Identifier of the unit.
symbolTypeId:
Identifier of the symbol to check.
Returns:
True if the symbol is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanHaveSymbol
Checks whether a symbol can be specified to display the unit in this FormatOptions.
Returns:
True if a symbol can be specified, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanHaveSymbol(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a symbol can be specified to display a given unit.
unitTypeId:
Identifier of the unit.
Returns:
True if a symbol can be specified, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.SetSymbolTypeId(Autodesk.Revit.DB.ForgeTypeId)
Sets the symbol that should be displayed to indicate the unit quantifying the value.
symbolTypeId:
The symbol identifier. An empty identifier string indicates no symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
symbolTypeId is not a valid symbol for the unit in this FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetSymbolTypeId
Gets the identifier of the symbol indicating the unit quantifying the value.
Returns:
The symbol identifier. An empty identifier string indicates no symbol.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidForSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether this FormatOptions is valid for a given spec.
Remarks:
The FormatOptions is valid if UseDefault is true or if the unit in
the FormatOptions is valid for the spec. See
UnitUtils.IsValidUnit(ForgeTypeId, ForgeTypeId) and
UnitUtils.GetValidUnits(ForgeTypeId).
specTypeId:
Identifier of the spec.
Returns:
True if the FormatOptions is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.SetUnitTypeId(Autodesk.Revit.DB.ForgeTypeId)
Sets the unit used to quantify values.
unitTypeId:
The unit identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetUnitTypeId
Gets the identifier of the unit used to quantify values.
Remarks:
Most units, such as square feet or degrees, are formatted as decimal
decimal numbers. Other units may be displayed with specialized
formatting methods like "feet and fractional inches" or "degrees,
minutes and seconds".
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.FormatOptions)
Creates a copy of a FormatOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
Creates a new FormatOptions object that represents custom formatting.
unitTypeId:
Identifier of the unit to display.
symbolTypeId:
Identifier of the symbol with which to render the unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
-or-
symbolTypeId is not a valid symbol for unitTypeId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.ForgeTypeId)
Creates a new FormatOptions object that represents custom formatting.
unitTypeId:
Identifier of the unit to display.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014